pipeFlowReg/case5_Steady_rad_sir2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)//1
    (200 0 0)//2
    (200 20 -0.7)//3
    (0 20 -0.7)//4
    (200 20 0.7)//5
    (0 20 0.7)//6
    
);

blocks
(
    hex (0 1 2 3 0 1 4 5)
    (100 10 1)
    simpleGrading (1 1 1)

  
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 5 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 4 1)
            
        );
    }
    upperWall
    {
        type wall;
        faces
        (
             (3 2 4 5)
        );
    }
    axis
    {
      type empty;
      faces
      (
           (0 1 1 0)    
      ); 
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
            
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 1 4 5)
          
        );
    }
);


// ************************************************************************* //
